Config/Catalogs/ВидыДоходовКДБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовКДБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подгруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подстатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АналитическиеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыДоходовКДБ/Forms/ПолнаяКлассификация/Ext/Form/Module.bsl
#Область ОписаниеПеременных 

&НаКлиенте
Перем ФормаПоискаКода;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДеревоКлассификатора.ТолькоПросмотр = НЕ ПравоДоступа("Редактирование", Метаданные.Справочники.ВидыДоходовКДБ);
	
	НаДату = Параметры.НаДату;
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = Макс(ТекущаяДатаСеанса(), Дата(2016, 1, 1));
	КонецЕсли;

	РежимВыбора = Ложь;
	
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	
	Если РежимВыбора Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Элементы.НаДату.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.ДеревоКлассификатора.РежимВыбора = Истина;
		Элементы.ГруппыПодвидовКДБ.РежимВыбора = Истина;
	КонецЕсли;	
	
	ТекГруппаПодвида = Параметры.ГруппаПодвида;
	
	Если Параметры.ТекущаяСтрока <> Неопределено Тогда
		ВидДохода = Неопределено;
		ТекСтрока = Параметры.ТекущаяСтрока;
		ТекКОСГУ = Неопределено;
		Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("Строка") Тогда
			КодПоиска = Лев(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СтрЗаменить(Параметры.ТекущаяСтрока, " ", ""), 17, "0", "Справа"), 17);
			// разделим пробелами
			КодПоиска = Сред(КодПоиска, 1, 1) + " " + Сред(КодПоиска, 2, 2) + " " + Сред(КодПоиска, 4, 5) + " " + Сред(КодПоиска, 9, 2) + " " + Сред(КодПоиска, 11, 4) + " " + Сред(КодПоиска, 15, 3);
			СтруктураПоиска = Новый Структура("ГруппаПодвида");
			ТекСтрока = Справочники.ВидыДоходовКДБ.НайтиВКлассификации(КодПоиска, СтруктураПоиска, Параметры.Бюджет, НаДату);
			Если НЕ ТекСтрока = Неопределено Тогда
				 ВидДохода = СтруктураПоиска.ВидДохода;
				 ТекГруппаПодвида = СтруктураПоиска.ГруппаПодвида;
				 ТекКОСГУ = СтруктураПоиска.КОСГУ;
			КонецЕсли;	 
		Иначе	
			Если ЗначениеЗаполнено(Параметры.ВидДохода) Тогда
				ВидДохода = Параметры.ВидДохода;
			ИначеЕсли ТипЗнч(Параметры.ДополнительныйОтбор) = Тип("Структура") Тогда
				Если Не Параметры.ДополнительныйОтбор.Свойство("ВидДохода", ВидДохода) Тогда
					Параметры.ДополнительныйОтбор.Свойство("Владелец", ВидДохода);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СпозиционироватьДеревоНаСсылке(ТекСтрока, ВидДохода, ТекКОСГУ);
	Иначе	
		СпозиционироватьДеревоНаСсылке(Неопределено);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекГруппаПодвида) Тогда
		Элементы.ГруппыПодвидовКДБ.ТекущаяСтрока = ТекГруппаПодвида;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Обычная 
		И ТипЗнч(Источник) = Тип("УправляемаяФорма") 
		И ИмяСобытия = "КлассификаторДоходов.ИзменениеЭлемента" 
		И Источник.ВладелецФормы = ЭтотОбъект Тогда
		
		СпозиционироватьДеревоНаСсылке(Параметр);
		
	ИначеЕсли ИмяСобытия = "ПоискКодаКлассификатораДоходовВФорме" И Источник.ВладелецФормы = ЭтотОбъект Тогда
		
		СпозиционироватьДеревоНаСсылке(Параметр.Ссылка,, Параметр.КОСГУ);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	ОбновитьСписок(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКлассификатора

&НаКлиенте
Процедура ДеревоКлассификатораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборЗначенияКлассификатора(ВыбраннаяСтрока, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработатьВыборЗначенияКлассификатора(Значение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПередРазворачиванием(Элемент, Строка, Отказ)
	СтрокаДерева = ДеревоКлассификатора.НайтиПоИдентификатору(Строка);
	Если Не СтрокаДерева.Обработано Тогда
		ЗаполнитьСтрокуНаСервере(Строка);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Копирование Тогда
		ОткрытьФормуНовогоСправочника(Новый Структура("ЗначениеКопирования", ТекДанные.Ссылка));
	Иначе
		
		Если ТекДанные = Неопределено Тогда
			ОткрытьФормуНовогоСправочника();
		Иначе
				
			// Заполнение нового элемента.
			СтруктураДанных = ЗаполнитьВышестоящиеСсылки(ТекДанные);
			
			ДанныеЗаполнения = Новый Структура;
			
			ДанныеЗаполнения.Вставить("Родитель", 				СтруктураДанных.Группа);
			ДанныеЗаполнения.Вставить("ДатаНачалаДействия",		СтруктураДанных.ДатаНачалаДействия);
			ДанныеЗаполнения.Вставить("ДатаОкончанияДействия",	СтруктураДанных.ДатаОкончанияДействия);
			ДанныеЗаполнения.Вставить("ОкончаниеДействия",		СтруктураДанных.ОкончаниеДействия);
						
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ДанныеЗаполнения);
			
			ОткрытьФормуНовогоСправочника(ПараметрыФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		
		ОткрытьФормуЭлементаСправочника(ТекДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ВыделенныеСтроки = Элемент.ВыделенныеСтроки;
	СчетчикИстина    = 0;
	СчетчикЛожь      = 0;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		
		ТД = ДеревоКлассификатора.НайтиПоИдентификатору(Идентификатор);
		
		Если ТД.ПометкаУдаления Тогда
			СчетчикИстина = СчетчикИстина + 1;
		Иначе
			СчетчикЛожь   = СчетчикЛожь + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущаяПометка  = (СчетчикИстина > СчетчикЛожь);
	ИтоговаяПометка = Не ТекущаяПометка;
	
	ТекстСообщения = ?(ИтоговаяПометка,НСтр("ru = 'Пометить выделенные элементы на удаление?'"),НСтр("ru = 'Снять с выделенных элементов пометку на удаление?'"));
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ДеревоКлассификатораПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки, ИтоговаяПометка, ТекстСообщения", ВыделенныеСтроки, ИтоговаяПометка, ТекстСообщения)), ТекстСообщения,РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификатораПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки 	= ДополнительныеПараметры.ВыделенныеСтроки;
    ИтоговаяПометка 	= ДополнительныеПараметры.ИтоговаяПометка;
    ТекстСообщения 		= ДополнительныеПараметры.ТекстСообщения;
    
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        
        ПараметрыНавигационнойСсылки = Неопределено;
        
        КоличествоПомеченных         = УстановитьПометкуУдаления(ВыделенныеСтроки, ИтоговаяПометка, ПараметрыНавигационнойСсылки);
        
        Если ИтоговаяПометка = Истина Тогда
            ТекстСообщения = НСтр("ru = 'Пометка удаления установлена (%1)'");
        Иначе
            ТекстСообщения = НСтр("ru = 'Пометка удаления снята (%1)'");
        КонецЕсли;
        
        Если КоличествоПомеченных <> 1 Тогда
            ПараметрыНавигационнойСсылки = Неопределено;
        КонецЕсли;
        
        ПоказатьОповещениеПользователя(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, КоличествоПомеченных),
        ?(ПараметрыНавигационнойСсылки = Неопределено,Неопределено, ПараметрыНавигационнойСсылки.НавигационнаяСсылка),
        ?(ПараметрыНавигационнойСсылки = Неопределено,ЭтаФорма.Заголовок, ПараметрыНавигационнойСсылки.Текст),
        БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппыПодвидовКДБ

&НаКлиенте
Процедура ГруппыПодвидовКДБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборЗначенияКлассификатора(Элементы.ДеревоКлассификатора.ТекущаяСтрока, СтандартнаяОбработка, ВыбраннаяСтрока)

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПодвидовКДБВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработатьВыборЗначенияКлассификатора(Элементы.ДеревоКлассификатора.ТекущаяСтрока, СтандартнаяОбработка, Значение)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	Перем ТекСсылка,ТекКОСГУ;
	
	ТекущаяСтрока = Элементы.ДеревоКлассификатора.ТекущиеДанные;
	
	Если Не ТекущаяСтрока = Неопределено Тогда
		ТекСсылка = ТекущаяСтрока.Ссылка;
		ТекКОСГУ = ТекущаяСтрока.СсылкаКОСГУ;
	КонецЕсли;
	
	СпозиционироватьДеревоНаСсылке(ТекСсылка,,ТекКОСГУ);
	
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	
	ПараметрыФормы  = Новый Структура("ДатаАктуальности", НаДату);
	
	Если ТипЗнч(ФормаПоискаКода) = Тип("УправляемаяФорма") И ФормаПоискаКода.Открыта() Тогда
		ФормаПоискаКода.Закрыть();
	КонецЕсли;	
	
	ФормаПоискаКода = ОткрытьФорму("Справочник.ВидыДоходовКДБ.Форма.ПоискКода", ПараметрыФормы, ЭтаФорма);  
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСписокДляПечати(Команда)
	МассивВыделенныхСтрок = Новый Массив;
	Для Каждого ТекСтр Из Элементы.ДеревоКлассификатора.ВыделенныеСтроки Цикл
		МассивВыделенныхСтрок.Добавить(ТекСтр);
	КонецЦикла;
	
	АдресДанныхДляПечати = ПолучитьАдресДанныхВыделенныхСтрок(МассивВыделенныхСтрок);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаДату",НаДату);
	ПараметрыФормы.Вставить("АдресДанныхДляПечати",АдресДанныхДляПечати);
	ПараметрыФормы.Вставить("АдресДереваКлассификатора",АдресДерева);
	
	ОткрытьФорму("Справочник.ВидыДоходовКДБ.Форма.ФормаПечатиКлассификатора",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоСправочника(ПараметрыФормы = Неопределено)
	
	ОткрытьФорму("Справочник.ВидыДоходовКДБ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры // ОткрытьФормуЭлементаСправочника()

&НаКлиенте
Процедура ОткрытьФормуЭлементаСправочника(Ссылка)

	ПараметрыФормы = Новый Структура("Ключ",Ссылка);
	ОткрытьФорму("Справочник.ВидыДоходовКДБ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры // ОткрытьФормуЭлементаСправочника()

// Поднимаясь вверх по иерархии ищет ссылку на группу доходов.
//
&НаКлиенте
Функция ЗаполнитьВышестоящиеСсылки(ТекСтрока)
	
	СтруктураДанных = Новый Структура("Группа,Статья, ДатаНачалаДействия, ДатаОкончанияДействия, ОкончаниеДействия");
	
	ЗаполнитьДанныеТекущегоУровня(ТекСтрока, СтруктураДанных);
			
	Возврат СтруктураДанных;

КонецФункции // НайтиТекущуюГруппуДоходов()

&НаКлиенте
Процедура ЗаполнитьДанныеТекущегоУровня(ТекСтрока, СтруктураДанных)

	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(ТекСтрока.Ссылка);
			
	Если Не ЗначениеЗаполнено(СтруктураДанных.Группа) Тогда
		СтруктураДанных.Группа = ТекСтрока.Ссылка;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекСтрока, "ДатаНачалаДействия,ДатаОкончанияДействия,ОкончаниеДействия");

	Если Не ЗначениеЗаполнено(СтруктураДанных.Группа) Тогда
		// Поискать повыше.
		СтрРодитель = ТекСтрока.ПолучитьРодителя();
		ЗаполнитьДанныеТекущегоУровня(СтрРодитель, СтруктураДанных);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция УстановитьПометкуУдаления(ВыделенныеСтроки, ЗначениеПометки, НавигационнаяСсылкаОбъекта = Неопределено)

	Перем ПоследнийОбъект;
	
	КоличествоПомеченных = 0;
	ОбработанныеСсылки   = Новый Соответствие;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		
		ТД = ДеревоКлассификатора.НайтиПоИдентификатору(Идентификатор);
		
		// Проверка, что это не корень дерева.
		Если Не ЗначениеЗаполнено(ТД.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		// Регистрация факта передачи объекта на обработку.
		КоличествоПомеченных = КоличествоПомеченных + 1;
		
		// Если фактическая обработка не требуется, то элемент пропускается.
		Если ОбработанныеСсылки[ТД.Ссылка] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		// Установка пометки на объект (и автоматическая рекурсивная пометка подчиненных)
		Объект = ТД.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(ЗначениеПометки);
		
		УстановитьПризнакПометкиВДереве(ТД, ЗначениеПометки, ОбработанныеСсылки);

		ПоследнийОбъект = ТД;
		
	КонецЦикла;

	// Заполнение параметров навигационной ссылки.
	Если Не ПоследнийОбъект = Неопределено Тогда
		ЛокНавигационнаяСсылка 			= ПолучитьНавигационнуюСсылку(ТД.Ссылка);
		ПараметрыСсылки        			= Новый Структура("НавигационнаяСсылка,Текст", ЛокНавигационнаяСсылка, ТД.Код);
		НавигационнаяСсылкаОбъекта    	= ПараметрыСсылки;
	КонецЕсли;
	
	Возврат КоличествоПомеченных;
	
КонецФункции // УстановитьПометкуУдаления()

// Вспомогательная процедура обновления пометки в строках дерева.
//
&НаСервере
Процедура УстановитьПризнакПометкиВДереве(ТекущаяСтрока,ЗначениеПометки, ОбработанныеСсылки = Неопределено)

	ТекущаяСтрока.ПометкаУдаления = ЗначениеПометки;
	
	Если НЕ ТекущаяСтрока.ИндексКартинки = 4 Тогда
		ТекущаяСтрока.ИндексКартинки  = Число(ЗначениеПометки) + 2;
	КонецЕсли;	
	
	Если ОбработанныеСсылки <> Неопределено Тогда
		ОбработанныеСсылки.Вставить(ТекущаяСтрока.Ссылка, Истина);
	КонецЕсли;
	
	Для Каждого Стр Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		УстановитьПризнакПометкиВДереве(Стр,ЗначениеПометки, ОбработанныеСсылки);
	КонецЦикла;

КонецПроцедуры // УстановитьПризнакПометкиВДереве()

&НаКлиенте
Функция РежимВыбораВЭлементУправления()
	
	ТипыПоляВвода = Новый Массив;
	
	ТипыПоляВвода.Добавить(Тип("ПолеФормы"));
		 
	#Если НЕ (ТонкийКлиент ИЛИ ВебКлиент) Тогда
		ТипыПоляВвода.Добавить(Тип("ПолеВвода"));
	#КонецЕсли
	
	Возврат (НЕ ТипыПоляВвода.Найти(ТипЗнч(ЭтаФорма.ВладелецФормы)) = Неопределено);
		
КонецФункции // РежимВыбораВЭлементУправления()

&НаКлиенте
Процедура ОбработатьВыборЗначенияКлассификатора(ВыбраннаяСтрока, СтандартнаяОбработка, ГруппаПодвида = Неопределено)
	
	СтрокаДерева = ДеревоКлассификатора.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Параметры.РежимВыбора Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.ОтветСтруктурой = Истина Тогда
			
			Ответ = Новый Структура();
			Ответ.Вставить("Ссылка", СтрокаДерева.Ссылка);
			Ответ.Вставить("АналитическаяГруппа", СтрокаДерева.СсылкаКОСГУ);
			Ответ.Вставить("ГруппаПодвида", ГруппаПодвида);
				
			ОповеститьОВыборе(Ответ);
		
		ИначеЕсли РежимВыбораВЭлементУправления() Тогда
			
			ОповеститьОВыборе(СтрокаДерева.Ссылка);
			
			ОповеститьОВыборе(СтрокаДерева.СсылкаКОСГУ);
			
			ОповеститьОВыборе(ГруппаПодвида);
			
		ИначеЕсли ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаДерева.СсылкаКОСГУ) Тогда
				ОповеститьОВыборе(СтрокаДерева.Ссылка);
			Иначе
				
				Ответ = Новый Структура();
				Ответ.Вставить("Ссылка", СтрокаДерева.Ссылка);
				Ответ.Вставить("АналитическаяГруппа", СтрокаДерева.СсылкаКОСГУ);
				Ответ.Вставить("ГруппаПодвида", ГруппаПодвида);

				ОповеститьОВыборе(Ответ);
				
			КонецЕсли;
		Иначе
			ОповеститьОВыборе(СтрокаДерева.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНеобходимостиЗаполнения()
	
	Если Элементы.ДеревоКлассификатора.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.ДеревоКлассификатора.ТекущиеДанные.Свойство("Ссылка") И ЗначениеЗаполнено(Элементы.ДеревоКлассификатора.ТекущиеДанные.Ссылка) Тогда
			УстановитьОтборГруппПодвидов(Элементы.ДеревоКлассификатора.ТекущиеДанные.Ссылка);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборГруппПодвидов(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборГруппПодвидов(Ссылка)
	
	Если Ссылка = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппыПодвидовКДБ.Отбор, "ВидДохода", "", ВидСравненияКомпоновкиДанных.Равно,, Истина);

	Иначе
		СписокДляОтбора = Новый СписокЗначений();
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
		СписокДляОтбора.Добавить(Ссылка);
		СписокДляОтбора.Добавить(Справочники.ВидыДоходовКДБ.ПустаяСсылка());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппыПодвидовКДБ.Отбор, "ВидДохода", СписокДляОтбора, ВидСравненияОтбора,, Истина);
    КонецЕсли;
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункцииФормированияДерева

// Заполняет дерево значениями групп.
//
&НаСервере
Процедура ЗаполнитьДеревоНачальнымиЗначениями(Дерево)

	Справочники.ВидыДоходовКДБ.ЗаполнитьДеревоКлассификатораДоходовДляФормы(Дерево,НаДату);

КонецПроцедуры // ЗаполнитьДеревоНачальнымиЗначениями()

// Устанавливает текущую строку дерева, попутно раскрывая все необходимые ветки.
// Если в дереве установлен отбор и ссылка не попадает в условия отбора, то позиционирование не выполняется.
//
&НаСервере
Функция НайтиСсылкуВКлассификаторе(Дерево, Ссылка, ВидДохода, КОСГУ)

	Перем ИскомаяСтрока;
	
	ТекущийТип = ТипЗнч(Ссылка);
	
	// Прямой поиск ссылки.
	Если ЗначениеЗаполнено(КОСГУ) Тогда
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("Ссылка, СсылкаКОСГУ", Ссылка, КОСГУ), Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ИскомаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
	Иначе	
		ИскомаяСтрока = Дерево.Строки.Найти(Ссылка, "Ссылка", Истина);
	КонецЕсли;
	
	Если ИскомаяСтрока = Неопределено Тогда
		
		Если ТекущийТип = Тип("Строка") Тогда 	
			
			ИскомаяСтрока = Дерево.Строки.Найти(СокрЛП(Ссылка), "Код", Истина);
			
		ИначеЕсли ТекущийТип = Тип("СправочникСсылка.КОСГУ") И ЗначениеЗаполнено(ВидДохода) Тогда
			
			МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("Ссылка, СсылкаКОСГУ", ВидДохода, Ссылка), Истина);
			
			Если МассивСтрок.Количество() > 0 Тогда
				ИскомаяСтрока = МассивСтрок[0];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИскомаяСтрока;

КонецФункции // НайтиСсылкуВКлассификаторе()

&НаСервере
Процедура УстановитьТекущуюСтрокуДереваНаСсылку(Знач СтрокаДереваЗначений)

	СтэкУровнейДерева = Новый Массив;
	
	Пока СтрокаДереваЗначений.Родитель <> Неопределено Цикл
		
		КоллекцияТекущейСтроки = СтрокаДереваЗначений.Родитель.Строки;
		
		ИндексТекущейСтроки	   = КоллекцияТекущейСтроки.Индекс(СтрокаДереваЗначений);
		
		СтэкУровнейДерева.Вставить(0, ИндексТекущейСтроки);
		
		СтрокаДереваЗначений = СтрокаДереваЗначений.Родитель;
		
	КонецЦикла;
	
	ИдентификаторПозиции  = Неопределено;
	ТекущаяКоллекцияФормы = ДеревоКлассификатора.ПолучитьЭлементы()[0].ПолучитьЭлементы();
	
	Для Каждого Индекс Из СтэкУровнейДерева Цикл
		
		ТекущаяСтрока 		 = ТекущаяКоллекцияФормы[Индекс];
		ИдентификаторПозиции = ТекущаяСтрока.ПолучитьИдентификатор();
		
		ТекущаяКоллекцияФормы = ТекущаяСтрока.ПолучитьЭлементы();
			
	КонецЦикла;
	
	Элементы.ДеревоКлассификатора.ТекущаяСтрока = ИдентификаторПозиции;
		
КонецПроцедуры // УстановитьДанныеФормыНаСсылку()

&НаСервере
Процедура СпозиционироватьДеревоНаСсылке(Знач СсылкаТекущаяСтрока , Знач ВидДохода = Неопределено, Знач КОСГУ = Неопределено)

	Дерево = РеквизитФормыВЗначение("ДеревоКлассификатора");
	//Принцип следующий:
	//- если у строки нет подчиненных строк, или подчиненные строки уже добавили, ставим ей признак Обработано = Истина
	//- на клиенте перед разворачиванием проверяем, если признак не установлен, то идем на сервер, 
	//формируем дерево для этого вида дохода, ищем в дереве этот вид дохода, добавляем в дерево на форму и устанавливаем признак строке
		
	ТребуетсяНачальноеЗаполнение = Истина;
	Если (ЗначениеЗаполнено(СсылкаТекущаяСтрока)
		И ОбщегоНазначения.СсылкаСуществует(СсылкаТекущаяСтрока))
		ИЛИ ЗначениеЗаполнено(ВидДохода) Тогда
		Если ЗначениеЗаполнено(ВидДохода) Тогда
			ИскомыйВидДохода = ВидДохода;
		ИначеЕсли ТипЗнч(СсылкаТекущаяСтрока) = Тип("СправочникСсылка.ВидыДоходовКДБ") Тогда
			ИскомыйВидДохода = СсылкаТекущаяСтрока;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИскомыйВидДохода) Тогда
			//Возможно это обработка оповещения об изменении элемента.
			//Элемент мог быть закрыт, и дата закрытия меньше даты на которую формируется дерево.
			//Тогда заменим искомый вид дохода на его родителя.
			
			РеквизитыДохода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИскомыйВидДохода,"Родитель,ДатаОкончанияДействия");
			Если РеквизитыДохода.ДатаОкончанияДействия < НаДату
				И ЗначениеЗаполнено(РеквизитыДохода.Родитель) Тогда
				ИскомыйВидДохода = РеквизитыДохода.Родитель;
				СсылкаТекущаяСтрока = РеквизитыДохода.Родитель;//для позиционирования в дереве
			КонецЕсли;
			
			Справочники.ВидыДоходовКДБ.ЗаполнитьДеревоКлассификатораДоходовДляФормы(Дерево,НаДату,,ИскомыйВидДохода);
			ТребуетсяНачальноеЗаполнение = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяНачальноеЗаполнение Тогда
		ЗаполнитьДеревоНачальнымиЗначениями(Дерево);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево,"ДеревоКлассификатора");
	
	Если ЗначениеЗаполнено(СсылкаТекущаяСтрока) ИЛИ ЗначениеЗаполнено(ВидДохода) Тогда
		ИскомаяСтрока = НайтиСсылкуВКлассификаторе(Дерево, СсылкаТекущаяСтрока, ВидДохода, КОСГУ);
	Иначе
		ИскомаяСтрока = Неопределено;
	КонецЕсли;
			
	ТекСтрока = Неопределено;
	// Поиск по всем веткам.
	Если ИскомаяСтрока <> Неопределено Тогда			
		УстановитьТекущуюСтрокуДереваНаСсылку(ИскомаяСтрока);
		ТекСтрока = ДеревоКлассификатора.НайтиПоИдентификатору(Элементы.ДеревоКлассификатора.ТекущаяСтрока);
	КонецЕсли;
	
	УстановитьПризнакОбработано(ДеревоКлассификатора,2,ТекСтрока);
	
	ТекСтрока = Элементы.ДеревоКлассификатора.ТекущаяСтрока;
	
	Дерево.Строки.Очистить();
	АдресДерева = ПоместитьВоВременноеХранилище(Дерево,УникальныйИдентификатор);
	
КонецПроцедуры // СпозиционироватьДеревоНаСсылке()

&НаСервере
Процедура УстановитьПризнакОбработано(Дерево,Уровень,ТекСтрока)
	Для Каждого СтрокаДерева Из Дерево.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Уровень<Уровень Тогда
			СтрокаДерева.Обработано = Истина;
			УстановитьПризнакОбработано(СтрокаДерева, Уровень,ТекСтрока);
		Иначе
			
			Если СтрокаДерева = ТекСтрока Тогда
				//это найденная строка, для нее уже загружены подчиненные коды, если они есть
				СтрокаДерева.Обработано = Истина;
				
			ИначеЕсли СтрокаДерева.ПолучитьЭлементы().Количество() = 0 Тогда
				//фиктивная строка для появления "+" в дереве
				СтрокаДерева.ПолучитьЭлементы().Добавить();
			Иначе
				СтрокаДерева.Обработано = Истина;
				УстановитьПризнакОбработано(СтрокаДерева, Уровень,ТекСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуНаСервере(ИдСтроки)
	СтрокаДерева = ДеревоКлассификатора.НайтиПоИдентификатору(ИдСтроки);
	
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	
	СтрокаДерева.Обработано = Истина;
	
	ПолноеДерево = ПолучитьИзВременногоХранилища(АдресДерева);
	
	Справочники.ВидыДоходовКДБ.ЗаполнитьДеревоКлассификатораДоходовДляФормы(ПолноеДерево,НаДату,СтрокаДерева.Ссылка);
	
	СтруктураПоиска = Новый Структура("Ссылка,СсылкаКОСГУ",СтрокаДерева.Ссылка,СтрокаДерева.СсылкаКОСГУ);
	НайденныеСтроки = ПолноеДерево.Строки.НайтиСтроки(СтруктураПоиска,Истина);
	
	Если НайденныеСтроки.Количество() Тогда
		КоллекцияТекущая = СтрокаДерева.ПолучитьЭлементы();
		Для Каждого СтрПД Из НайденныеСтроки[0].Строки Цикл
			НовСтр = КоллекцияТекущая.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,СтрПД);
			Если СтрПД.Строки.Количество() = 0 Тогда
				НовСтр.Обработано = Истина;//нечего разворачивать;
			Иначе
				НовСтр.Обработано = Ложь;
				//добавим фиктивную строку для "+" в дереве
				НовСтр.ПолучитьЭлементы().Добавить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДанныхВыделенныхСтрок(МассивВыделенных) 
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("СправочникСсылка.ВидыДоходовКДБ"));
	ТаблицаДанных.Колонки.Добавить("Код",Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("СсылкаКОСГУ",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));

	Для Каждого ТекИд Из МассивВыделенных Цикл
		СтрДерева = ДеревоКлассификатора.НайтиПоИдентификатору(ТекИд);
		НовСтр = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НовСТр,СтрДерева);
	КонецЦикла;
	ТаблицаДанных.Сортировать("Код");
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДанных,УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#КонецОбласти
